#PANDAS

In [4]:
import numpy as np

In [5]:
import pandas as pd

In [6]:
my_list=[1,2,3,4]

In [7]:
my_labels=['a','b','c','d']

In [8]:
np_arr=np.array([10,20,30,40])

In [9]:
my_labels

['a', 'b', 'c', 'd']

In [10]:
np_arr

array([10, 20, 30, 40])

In [11]:
my_dict={'a':10,'b':20,'c':30,'d':40}

In [12]:
my_dict

{'a': 10, 'b': 20, 'c': 30, 'd': 40}

In [13]:
pd.Series(data=my_list)

0    1
1    2
2    3
3    4
dtype: int64

In [14]:
pd.Series(data=my_list,index=my_labels
         )

a    1
b    2
c    3
d    4
dtype: int64

In [15]:
pd.Series(my_list,my_labels)

a    1
b    2
c    3
d    4
dtype: int64

In [16]:
pd.Series(my_dict)

a    10
b    20
c    30
d    40
dtype: int64

In [17]:
pd.Series([sum,len,print])

0      <built-in function sum>
1      <built-in function len>
2    <built-in function print>
dtype: object

In [18]:
ser1=pd.Series(my_list,my_labels)

In [19]:
ser1

a    1
b    2
c    3
d    4
dtype: int64

In [20]:
ser2=pd.Series([10,20,30,49],"a b c d".split())

In [21]:
ser2

a    10
b    20
c    30
d    49
dtype: int64

In [22]:
ser2['d']

49

In [23]:
ser1+ser2

a    11
b    22
c    33
d    53
dtype: int64

In [24]:
from numpy.random import randn
np.random.seed(43)

In [25]:
df=pd.DataFrame(randn(5,4),index="a b c d e".split(),columns="w x y z".split())

In [26]:
df

          w         x         y         z
a  0.257400 -0.908481 -0.378503 -0.534916
b  0.858073 -0.413010  0.498189  2.010199
c  1.262862 -0.439215 -0.346438  0.455320
d -1.668663 -0.862085  0.492911 -0.124313
e  1.935136 -0.618443 -1.046839 -0.889618

In [27]:
df['z']

a   -0.534916
b    2.010199
c    0.455320
d   -0.124313
e   -0.889618
Name: z, dtype: float64

In [28]:
df['w']

a    0.257400
b    0.858073
c    1.262862
d   -1.668663
e    1.935136
Name: w, dtype: float64

In [29]:
type(df['w'])

pandas.core.series.Series

In [30]:
df[['x','y','z']]

          x         y         z
a -0.908481 -0.378503 -0.534916
b -0.413010  0.498189  2.010199
c -0.439215 -0.346438  0.455320
d -0.862085  0.492911 -0.124313
e -0.618443 -1.046839 -0.889618

In [31]:
df.x

a   -0.908481
b   -0.413010
c   -0.439215
d   -0.862085
e   -0.618443
Name: x, dtype: float64

In [32]:
df['y+z']=df['y']+df['z']

In [33]:
df

          w         x         y         z       y+z
a  0.257400 -0.908481 -0.378503 -0.534916 -0.913419
b  0.858073 -0.413010  0.498189  2.010199  2.508388
c  1.262862 -0.439215 -0.346438  0.455320  0.108882
d -1.668663 -0.862085  0.492911 -0.124313  0.368597
e  1.935136 -0.618443 -1.046839 -0.889618 -1.936457

In [34]:
df['y-z']=df['y']-df['z']

In [35]:
df

          w         x         y         z       y+z       y-z
a  0.257400 -0.908481 -0.378503 -0.534916 -0.913419  0.156412
b  0.858073 -0.413010  0.498189  2.010199  2.508388 -1.512011
c  1.262862 -0.439215 -0.346438  0.455320  0.108882 -0.801758
d -1.668663 -0.862085  0.492911 -0.124313  0.368597  0.617224
e  1.935136 -0.618443 -1.046839 -0.889618 -1.936457 -0.157221

In [36]:
df.drop('y-z',axis=1)

          w         x         y         z       y+z
a  0.257400 -0.908481 -0.378503 -0.534916 -0.913419
b  0.858073 -0.413010  0.498189  2.010199  2.508388
c  1.262862 -0.439215 -0.346438  0.455320  0.108882
d -1.668663 -0.862085  0.492911 -0.124313  0.368597
e  1.935136 -0.618443 -1.046839 -0.889618 -1.936457

In [37]:
df

          w         x         y         z       y+z       y-z
a  0.257400 -0.908481 -0.378503 -0.534916 -0.913419  0.156412
b  0.858073 -0.413010  0.498189  2.010199  2.508388 -1.512011
c  1.262862 -0.439215 -0.346438  0.455320  0.108882 -0.801758
d -1.668663 -0.862085  0.492911 -0.124313  0.368597  0.617224
e  1.935136 -0.618443 -1.046839 -0.889618 -1.936457 -0.157221

In [38]:
df.drop('y-z',axis=1,inplace=True)

In [39]:
df

          w         x         y         z       y+z
a  0.257400 -0.908481 -0.378503 -0.534916 -0.913419
b  0.858073 -0.413010  0.498189  2.010199  2.508388
c  1.262862 -0.439215 -0.346438  0.455320  0.108882
d -1.668663 -0.862085  0.492911 -0.124313  0.368597
e  1.935136 -0.618443 -1.046839 -0.889618 -1.936457

In [40]:
df.drop('e',axis=0,inplace=True)

In [41]:
df

          w         x         y         z       y+z
a  0.257400 -0.908481 -0.378503 -0.534916 -0.913419
b  0.858073 -0.413010  0.498189  2.010199  2.508388
c  1.262862 -0.439215 -0.346438  0.455320  0.108882
d -1.668663 -0.862085  0.492911 -0.124313  0.368597

In [42]:
df['w']

a    0.257400
b    0.858073
c    1.262862
d   -1.668663
Name: w, dtype: float64

In [43]:
df.loc['a']

w      0.257400
x     -0.908481
y     -0.378503
z     -0.534916
y+z   -0.913419
Name: a, dtype: float64

In [44]:
df.iloc[0]

w      0.257400
x     -0.908481
y     -0.378503
z     -0.534916
y+z   -0.913419
Name: a, dtype: float64

In [45]:
df.iloc[2]

w      1.262862
x     -0.439215
y     -0.346438
z      0.455320
y+z    0.108882
Name: c, dtype: float64

In [46]:
df.loc['a','z']

-0.5349155987755707

In [47]:
df.loc[['a','b']]

          w         x         y         z       y+z
a  0.257400 -0.908481 -0.378503 -0.534916 -0.913419
b  0.858073 -0.413010  0.498189  2.010199  2.508388

In [48]:
df.loc[['a','b'],['x','y']]

          x         y
a -0.908481 -0.378503
b -0.413010  0.498189

In [49]:
df>0

       w      x      y      z    y+z
a   True  False  False  False  False
b   True  False   True   True   True
c   True  False  False   True   True
d  False  False   True  False   True

In [50]:
df>(df>0)

       w      x      y      z    y+z
a  False  False  False  False  False
b  False  False  False   True   True
c   True  False  False  False  False
d  False  False  False  False  False

In [51]:
df[df>0]

          w   x         y         z       y+z
a  0.257400 NaN       NaN       NaN       NaN
b  0.858073 NaN  0.498189  2.010199  2.508388
c  1.262862 NaN       NaN  0.455320  0.108882
d       NaN NaN  0.492911       NaN  0.368597

In [52]:
df

          w         x         y         z       y+z
a  0.257400 -0.908481 -0.378503 -0.534916 -0.913419
b  0.858073 -0.413010  0.498189  2.010199  2.508388
c  1.262862 -0.439215 -0.346438  0.455320  0.108882
d -1.668663 -0.862085  0.492911 -0.124313  0.368597

In [53]:
df[df['w']<0]

          w         x         y         z       y+z
d -1.668663 -0.862085  0.492911 -0.124313  0.368597

In [54]:
df[df['w']<0]['x']

d   -0.862085
Name: x, dtype: float64

In [55]:
df[df['w']<0][['x','y']]

          x         y
d -0.862085  0.492911

In [56]:
df[(df['w']<0) and (df['y']>0)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
df[(df['w']<0)&(df['y']<0)]

In [ ]:
df[(df['w']<0)|(df['x']>0)]

In [ ]:
df.reset_index()

In [57]:
df.reset_index().drop('index',axis=1)

          w         x         y         z       y+z
0  0.257400 -0.908481 -0.378503 -0.534916 -0.913419
1  0.858073 -0.413010  0.498189  2.010199  2.508388
2  1.262862 -0.439215 -0.346438  0.455320  0.108882
3 -1.668663 -0.862085  0.492911 -0.124313  0.368597

In [58]:
df['Test']=[1,2,3,4]

In [59]:
df

          w         x         y         z       y+z  Test
a  0.257400 -0.908481 -0.378503 -0.534916 -0.913419     1
b  0.858073 -0.413010  0.498189  2.010199  2.508388     2
c  1.262862 -0.439215 -0.346438  0.455320  0.108882     3
d -1.668663 -0.862085  0.492911 -0.124313  0.368597     4

In [60]:
df.set_index('Test')

             w         x         y         z       y+z
Test
1     0.257400 -0.908481 -0.378503 -0.534916 -0.913419
2     0.858073 -0.413010  0.498189  2.010199  2.508388
3     1.262862 -0.439215 -0.346438  0.455320  0.108882
4    -1.668663 -0.862085  0.492911 -0.124313  0.368597

In [61]:
df['Test']

a    1
b    2
c    3
d    4
Name: Test, dtype: int64

In [62]:
df.loc[1]

TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [1] of <class 'int'>

In [63]:
df

          w         x         y         z       y+z  Test
a  0.257400 -0.908481 -0.378503 -0.534916 -0.913419     1
b  0.858073 -0.413010  0.498189  2.010199  2.508388     2
c  1.262862 -0.439215 -0.346438  0.455320  0.108882     3
d -1.668663 -0.862085  0.492911 -0.124313  0.368597     4

In [64]:
df=df.set_index('Test')

In [65]:
df

             w         x         y         z       y+z
Test
1     0.257400 -0.908481 -0.378503 -0.534916 -0.913419
2     0.858073 -0.413010  0.498189  2.010199  2.508388
3     1.262862 -0.439215 -0.346438  0.455320  0.108882
4    -1.668663 -0.862085  0.492911 -0.124313  0.368597

In [66]:
df.loc[1]

w      0.257400
x     -0.908481
y     -0.378503
z     -0.534916
y+z   -0.913419
Name: 1, dtype: float64

In [67]:
df['index']=[0,1,2,3]

In [68]:
df

             w         x         y         z       y+z  index
Test
1     0.257400 -0.908481 -0.378503 -0.534916 -0.913419      0
2     0.858073 -0.413010  0.498189  2.010199  2.508388      1
3     1.262862 -0.439215 -0.346438  0.455320  0.108882      2
4    -1.668663 -0.862085  0.492911 -0.124313  0.368597      3

In [69]:
df.set_index('index',inplace=True)

In [70]:
df

              w         x         y         z       y+z
index
0      0.257400 -0.908481 -0.378503 -0.534916 -0.913419
1      0.858073 -0.413010  0.498189  2.010199  2.508388
2      1.262862 -0.439215 -0.346438  0.455320  0.108882
3     -1.668663 -0.862085  0.492911 -0.124313  0.368597

In [71]:
outside=['g1','g1','g1','g2','g2','g2']
inside=[0,1,3,3,3,2]

In [72]:
index=pd.MultiIndex.from_tuples(list(zip(outside,inside)))

In [73]:
index

MultiIndex(levels=[['g1', 'g2'], [0, 1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 3, 3, 3, 2]])

In [74]:
import pandas as pd
import numpy as np
df=pd.DataFrame(np.random.randn(6,2),index=index,columns=['a','b'])

In [75]:

df

             a         b
g1 0  0.014041 -0.160830
   1  2.230360 -0.399116
   3  0.054445  0.884182
g2 3 -0.107981  0.555607
   3  0.394907  0.837205
   2 -1.407878  0.807849

In [76]:
df.loc['g2'].loc[3]

          a         b
3 -0.107981  0.555607
3  0.394907  0.837205

In [77]:
df.index.names

FrozenList([None, None])

In [78]:
df.index.names=['ankit','sanchit']

In [79]:
df

                      a         b
ankit sanchit
g1    0        0.014041 -0.160830
      1        2.230360 -0.399116
      3        0.054445  0.884182
g2    3       -0.107981  0.555607
      3        0.394907  0.837205
      2       -1.407878  0.807849

In [80]:
df.xs(['g2',3])

/home/ankittt2001/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:2874: PerformanceWarning: indexing past lexsort depth may impact performance.
  return runner(coro)

                      a         b
ankit sanchit
g2    3       -0.107981  0.555607
      3        0.394907  0.837205

In [81]:
df.xs(2,level=1)

              a         b
ankit
g2    -1.407878  0.807849

In [82]:
df=pd.DataFrame({'a':[10,20,np.nan],'b':[20,np.nan,np.nan],'c':[49,50,60]
})

In [83]:
df

      a     b   c
0  10.0  20.0  49
1  20.0   NaN  50
2   NaN   NaN  60

In [84]:
df.dropna()

      a     b   c
0  10.0  20.0  49

In [85]:
df

      a     b   c
0  10.0  20.0  49
1  20.0   NaN  50
2   NaN   NaN  60

In [86]:
df.dropna(axis=1)

    c
0  49
1  50
2  60

In [87]:
df.dropna(thresh=1)

      a     b   c
0  10.0  20.0  49
1  20.0   NaN  50
2   NaN   NaN  60

In [88]:
df.dropna(thresh=2)

      a     b   c
0  10.0  20.0  49
1  20.0   NaN  50

In [89]:
df

      a     b   c
0  10.0  20.0  49
1  20.0   NaN  50
2   NaN   NaN  60

In [90]:
df.fillna(value=df['c'].mean())

      a     b   c
0  10.0  20.0  49
1  20.0  53.0  50
2  53.0  53.0  60

In [91]:
df

      a     b   c
0  10.0  20.0  49
1  20.0   NaN  50
2   NaN   NaN  60

In [92]:
data={"company":["amazon","amazon","google","google","facebook","facebook"],"person":["an","bc","fd","dfd","df","gee"],"rank":[3,43,45,67,4456,86]}
df=pd.DataFrame(data)

In [93]:
df

    company person  rank
0    amazon     an     3
1    amazon     bc    43
2    google     fd    45
3    google    dfd    67
4  facebook     df  4456
5  facebook    gee    86

In [94]:
df_gby=df.groupby('company')

In [95]:
df_gby

In [96]:
df_gby.mean()

          rank
company
amazon      23
facebook  2271
google      56

In [97]:
df_gby.min()

         person  rank
company
amazon       an     3
facebook     df    86
google      dfd    45

In [98]:
dfh=df.groupby('company').min()

In [99]:
dfh.mean()
dfh

         person  rank
company
amazon       an     3
facebook     df    86
google      dfd    45

In [110]:
#or we can find max